Tekla.Structures.ModelInternal.dotBasePointData_t
Struct for base point data.

Tekla.Structures.ModelInternal.dotBasePointData_t.Id
Base point id.

Tekla.Structures.ModelInternal.dotBasePointData_t.NorthSouth
Location in north-south.

Tekla.Structures.ModelInternal.dotBasePointData_t.EastWest
Location in east-west.

Tekla.Structures.ModelInternal.dotBasePointData_t.Elevation
Elevation.

Tekla.Structures.ModelInternal.dotBasePointData_t.Latitude
Latitude.

Tekla.Structures.ModelInternal.dotBasePointData_t.Longitude
Longitude.

Tekla.Structures.ModelInternal.dotBasePointData_t.LocationInModelX
Base point location in model X.

Tekla.Structures.ModelInternal.dotBasePointData_t.LocationInModelY
Base point location in model Y.

Tekla.Structures.ModelInternal.dotBasePointData_t.LocationInModelZ
Base point location in model Z.

Tekla.Structures.ModelInternal.dotBasePointData_t.AngleToNorth
Angle to true north.

Tekla.Structures.ModelInternal.dotBasePointData_t.IsProjectBasePoint
Value indicating if this base point is the project base point.

Tekla.Structures.ModelInternal.dotBasePointData_t.IsCurrentBasePoint
Value indicating if this base point is the current base point.

Tekla.Structures.ModelInternal.dotBasePointData_t.IsLocked
Value indicating if this base point is Locked.

Tekla.Structures.ModelInternal.dotBasePointData_t.aGuid
The guid.

Tekla.Structures.ModelInternal.dotBasePointData_t.aInitialGuid
The initial guid.

Tekla.Structures.ModelInternal.dotBasePointData_t.aName
The name.

Tekla.Structures.ModelInternal.dotBasePointData_t.aDescription
The name.

Tekla.Structures.ModelInternal.dotBasePointData_t.aCoordinateSystem
The name.